book/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-17 Fri 15:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Introduction</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc3ee640">1. Welcome</a>
<ul>
<li><a href="#org57383cb">1.1. Goals</a></li>
</ul>
</li>
<li><a href="#orgc7ccd1a">2. Chapter RStudio</a></li>
<li><a href="#org8bf5ca7">3. Chapter Version Control</a></li>
<li><a href="#orgdd800c4">4. Linux</a></li>
<li><a href="#orgf5ea1cd">5. Terminal</a></li>
<li><a href="#orgba0c3f3">6. Emacs</a></li>
<li><a href="#org17a6e48">7. Beginning Python</a></li>
<li><a href="#org986214e">8. Beginning R</a></li>
<li><a href="#org321a733">9. Working With Data in Python</a></li>
<li><a href="#orgd9b6459">10. Basic Plotting</a></li>
<li><a href="#org7a648a3">11. Report Writing</a></li>
<li><a href="#org3802fa8">12. Programming Psychology Experiments</a></li>
<li><a href="#org478ed23">13. Final Projects</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgc3ee640" class="outline-2">
<h2 id="orgc3ee640"><span class="section-number-2">1.</span> Welcome</h2>
<div class="outline-text-2" id="text-1">
<p>
These are the course notes for Psych363 at the University of Waterloo: An Introduction to Computing for Psychology students. This current update is for the Spring 2023 term. 
</p>

<p>
This is the <i>index</i> file for finding your way through the course topics and activities. The later chapters often assume information from the earlier ones. I recommend you follow the topics in the order below. Work through each chapter in sequence and make sure you understand the basics before moving on. This will remove much confusion. Our term is twelve weeks long and there are twelve chapters. This means you will need to work through, on average, one chapter a week. I recommend you try to get the first two or three done in less time so as to allow more time for the more complex material that comes towards the end of the course. 
</p>

<p>
The videos that you will find embedded in this document can also be found on the course channel on <a href="https://vimeo.com/channels/i2c4p">vimeo</a>. The videos and the written material are meant to work together and you will usually need to both read and watch to learn what you need know in order to complete the assessments. I recommend skimming the entire text before watching any of the videos. Then go back and start working through the text. You can then watch the video and fast forward or skip sections that you understand.  My experience is that students who start with the videos, or only watch the videos, take longer and learn less. For most of you the worst approach is start with the assignments and then just try to skim around searching for solutions. The assessments are meant to help you learn. They are less about getting a score. I want you to be able to use these tools after the course is over. Approach the assessments as another tool for you to assess how well you have mastered the material. 
</p>
</div>

<div id="outline-container-org57383cb" class="outline-3">
<h3 id="org57383cb"><span class="section-number-3">1.1.</span> Goals</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The goal for the course is to expose you to an array of tools and techniques useful for research in psychology. Some of these tools are ancillary, e.g. managing a reference data base. Some of them are practical, such as programming a behavioral experiment. All of them will involve learning things about how to use your computer effectively. These fundamentals should serve you well even as the world of computing and computational tools evolve. It is the cliché of teaching one to fish. If you practice what is described here you will learn the ur-skills needed to master new tools and new techniques in the years to come.
</p>

<p>
Our more practical goals are suggested by the chapter headings below. You will get an introduction to programming and using programming languages to do the things academics need to do: Analyze data; Visualize Data; Collect Data; and Report Data. 
</p>

<p>
As the framework for accomplishing these tasks I will be requiring you to use the Linux operating system. Mostly this is so you come to a deeper understanding of what software is and how to make your computer work for you. I do not want you to master how to use a particular program on a particular operating system, but to acquire the meta knowledge that will enable you to learn how to use any piece of software on any computing platform that your future career requires. But we do have to start somewhere and the  installation process and terminology around Linux can be a big first step. Thus, our first lesson uses <a href="https://posit.co/">RStudio</a>. This allows me to introduce some of the ideas and concepts for programming while not letting us get stuck waiting for you to install a new operating system.
</p>

<p>
<b>Important Note</b> Computing changes quickly. Every time I teach this course some section of the notes, often large sections of the notes, go out of date. Most of the videos were made for the first pandemic offering in Winter 2020. If something seems wrong or doesn't work anymore then let me know so I can update things. You can do this most easily by using the <a href="https://github.com/brittAnderson/Intro2Computing4Psychology">github repository</a> for this course. Ideally, you would fix the mistake with a pull request (see the chapter on <a href="version-control.html#org0af0de5">version control</a>). But at a minimum you can report it as an <a href="https://github.com/brittAnderson/Intro2Computing4Psychology/issues">issue</a>. This also allows you to see if someone else has already reported the same mistake and a fix has been shared. 
</p>
</div>
</div>
</div>

<div id="outline-container-orgc7ccd1a" class="outline-2">
<h2 id="orgc7ccd1a"><span class="section-number-2">2.</span> Chapter RStudio</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="rstudio.html">RStudio</a>
</p>
</div>
</div>

<div id="outline-container-org8bf5ca7" class="outline-2">
<h2 id="org8bf5ca7"><span class="section-number-2">3.</span> Chapter Version Control</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="version-control.html">Version Control</a>
</p>
</div>
</div>

<div id="outline-container-orgdd800c4" class="outline-2">
<h2 id="orgdd800c4"><span class="section-number-2">4.</span> Linux</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="linux.html">Linux</a>
</p>
</div>
</div>

<div id="outline-container-orgf5ea1cd" class="outline-2">
<h2 id="orgf5ea1cd"><span class="section-number-2">5.</span> Terminal</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="terminal.html">Terminal</a>
</p>
</div>
</div>

<div id="outline-container-orgba0c3f3" class="outline-2">
<h2 id="orgba0c3f3"><span class="section-number-2">6.</span> Emacs</h2>
<div class="outline-text-2" id="text-6">
<p>
<a href="emacs.html">Emacs</a>
</p>
</div>
</div>

<div id="outline-container-org17a6e48" class="outline-2">
<h2 id="org17a6e48"><span class="section-number-2">7.</span> Beginning Python</h2>
<div class="outline-text-2" id="text-7">
<p>
<a href="beginning-python.html">Beginning Python</a>
</p>
</div>
</div>

<div id="outline-container-org986214e" class="outline-2">
<h2 id="org986214e"><span class="section-number-2">8.</span> Beginning R</h2>
<div class="outline-text-2" id="text-8">
<p>
<a href="beginning-r.html">Beginnning R</a>
</p>
</div>
</div>

<div id="outline-container-org321a733" class="outline-2">
<h2 id="org321a733"><span class="section-number-2">9.</span> Working With Data in Python</h2>
<div class="outline-text-2" id="text-9">
<p>
<a href="working-with-data-in-python.html">Working with data in Python</a>
</p>
</div>
</div>

<div id="outline-container-orgd9b6459" class="outline-2">
<h2 id="orgd9b6459"><span class="section-number-2">10.</span> Basic Plotting</h2>
<div class="outline-text-2" id="text-10">
<p>
<a href="basic-plotting.html">Basic Plotting</a>
</p>
</div>
</div>

<div id="outline-container-org7a648a3" class="outline-2">
<h2 id="org7a648a3"><span class="section-number-2">11.</span> Report Writing</h2>
<div class="outline-text-2" id="text-11">
<p>
<a href="report-writing.html">Report Writing</a>
</p>
</div>
</div>

<div id="outline-container-org3802fa8" class="outline-2">
<h2 id="org3802fa8"><span class="section-number-2">12.</span> Programming Psychology Experiments</h2>
<div class="outline-text-2" id="text-12">
<p>
<a href="programming-psychology-experiments.html">Programming Psychology Experiments</a>
</p>
</div>
</div>

<div id="outline-container-org478ed23" class="outline-2">
<h2 id="org478ed23"><span class="section-number-2">13.</span> Final Projects</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-01-13 Fri 00:00</p>
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2023-03-17 Fri 15:16</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>